<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="2" name="input_ids" type="Parameter" version="opset1">
			<data shape="1,384" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="attention_mask" type="Parameter" version="opset1">
			<data shape="1,384" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="token_type_ids" type="Parameter" version="opset1">
			<data shape="1,384" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="token_type_ids">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_22525" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2" offset="0" size="8" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_22518" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="8" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_38030" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 699" offset="3080" size="2796" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>699</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_22506" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="5876" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_38037" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 320" offset="8948" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_22475" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="10228" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_38044" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 560" offset="13300" size="2240" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_22463" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="15540" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_38051" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="18612" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_22432" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="19636" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_38058" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 545" offset="22708" size="2180" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>545</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_22420" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="24888" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_38065" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 448" offset="27960" size="1792" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_22389" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="29752" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_38072" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 942" offset="32824" size="3768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>942</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_22377" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="36592" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_38079" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 576" offset="39664" size="2304" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_22346" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="41968" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_38086" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1170" offset="45040" size="4680" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1170</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_22334" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="49720" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_38093" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 448" offset="52792" size="1792" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_22303" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="54584" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_38100" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1299" offset="57656" size="5196" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1299</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_22291" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="62852" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_38107" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 576" offset="65924" size="2304" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_22260" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="68228" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_38114" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1446" offset="71300" size="5784" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1446</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_22248" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="77084" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_38121" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 576" offset="80156" size="2304" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_22217" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="82460" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_38128" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1561" offset="85532" size="6244" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1561</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_22205" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="91776" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_38135" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 640" offset="94848" size="2560" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_22174" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="97408" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_38142" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1618" offset="100480" size="6472" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1618</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_22162" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="106952" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_38149" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 576" offset="110024" size="2304" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_22131" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="112328" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_38156" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1631" offset="115400" size="6524" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1631</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_22119" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="121924" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_38163" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 576" offset="124996" size="2304" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_22088" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="127300" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_38170" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1573" offset="130372" size="6292" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1573</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_22076" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="136664" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_38177" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="139736" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_22045" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="141784" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_38184" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1485" offset="144856" size="5940" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1485</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_22033" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="150796" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_38191" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 448" offset="153868" size="1792" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/nncf_module/bert/embeddings/word_embeddings/pre_ops.0/op/Constant" type="Const" version="opset1">
			<data element_type="i8" shape="30522, 768" offset="155660" size="23440896" />
			<output>
				<port id="0" precision="I8">
					<dim>30522</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Convert_23436" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>30522</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30522</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_23343" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="23596556" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/nncf_module/bert/embeddings/word_embeddings/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>30522</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/word_embeddings/pre_ops.0/op/FakeQuantize_output_0">
					<dim>30522</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_140" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="23596560" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="57" name="/nncf_module/bert/embeddings/word_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>30522</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/nncf_module/bert/embeddings/word_embeddings/Gather_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/nncf_module/bert/embeddings/token_type_embeddings/pre_ops.0/op/Constant" type="Const" version="opset1">
			<data element_type="i8" shape="2, 768" offset="23596568" size="1536" />
			<output>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Convert_23605" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_23512" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="23598104" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/nncf_module/bert/embeddings/token_type_embeddings/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/token_type_embeddings/pre_ops.0/op/FakeQuantize_output_0">
					<dim>2</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_146" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="23596560" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="63" name="/nncf_module/bert/embeddings/token_type_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/nncf_module/bert/embeddings/token_type_embeddings/Gather_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/nncf_module/bert/embeddings/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/Add_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_21989" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="23598108" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_21990" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="23598112" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_21991" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="23598108" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_21992" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="23598112" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/nncf_module/bert/embeddings/BertForQuestionAnswering/BertModel[bert]/BertEmbeddings[embeddings]/__add___0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/nncf_module/bert/embeddings/BertForQuestionAnswering/BertModel[bert]/BertEmbeddings[embeddings]/__add___0|OUTPUT/FakeQuantize_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/nncf_module/bert/embeddings/position_embeddings/pre_ops.0/op/Constant" type="Const" version="opset1">
			<data element_type="i8" shape="512, 768" offset="23598116" size="393216" />
			<output>
				<port id="0" precision="I8">
					<dim>512</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Convert_23774" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>512</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_23681" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="23991332" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/nncf_module/bert/embeddings/position_embeddings/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/position_embeddings/pre_ops.0/op/FakeQuantize_output_0">
					<dim>512</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="onnx::Gather_3385" type="Const" version="opset1">
			<data element_type="i64" shape="1, 384" offset="23991336" size="3072" />
			<output>
				<port id="0" precision="I64" names="onnx::Gather_3385">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_156" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="23596560" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="76" name="/nncf_module/bert/embeddings/position_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/nncf_module/bert/embeddings/position_embeddings/Gather_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_21997" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="23994408" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_21998" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="23994412" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_21999" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="23994408" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_22000" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="23994412" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/nncf_module/bert/embeddings/position_embeddings/BertForQuestionAnswering/BertModel[bert]/BertEmbeddings[embeddings]/NNCFEmbedding[position_embeddings]/embedding_0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/nncf_module/bert/embeddings/position_embeddings/BertForQuestionAnswering/BertModel[bert]/BertEmbeddings[embeddings]/NNCFEmbedding[position_embeddings]/embedding_0|OUTPUT/FakeQuantize_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/nncf_module/bert/embeddings/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/Add_1_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_162" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="23994416" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/nncf_module/bert/embeddings/LayerNorm/Div" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/LayerNorm/Div_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_22001" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="23994424" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/nncf_module/bert/embeddings/LayerNorm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/LayerNorm/Mul_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_22002" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="23997496" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/nncf_module/bert/embeddings/LayerNorm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/LayerNorm/Add_1_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_22003" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24000568" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_22004" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24000572" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_22005" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24000568" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_22006" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24000572" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/nncf_module/bert/encoder/layer.0/attention/self/query/BertForQuestionAnswering/BertModel[bert]/BertEncoder[encoder]/ModuleList[layer]/BertLayer[0]/BertAttention[attention]/BertSelfAttention[self]/NNCFLinear[query]/linear_0|INPUT0/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/query/BertForQuestionAnswering/BertModel[bert]/BertEncoder[encoder]/ModuleList[layer]/BertLayer[0]/BertAttention[attention]/BertSelfAttention[self]/NNCFLinear[query]/linear_0|INPUT0/FakeQuantize_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_38198" type="Const" version="opset1">
			<data element_type="i8" shape="448, 768" offset="24000576" size="344064" />
			<output>
				<port id="0" precision="I8">
					<dim>448</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Convert_23895" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>448</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>448</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_38205" type="Const" version="opset1">
			<data element_type="f32" shape="448, 1" offset="24344640" size="1792" />
			<output>
				<port id="0" precision="FP32">
					<dim>448</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/nncf_module/bert/encoder/layer.0/attention/self/query/pre_ops.1/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>448</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>448</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/query/pre_ops.1/op/FakeQuantize_output_0">
					<dim>448</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/nncf_module/bert/encoder/layer.0/attention/self/query/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>448</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/query/MatMul_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/nncf_module/bert/encoder/layer.0/attention/self/query/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/query/Add_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_22008" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24346432" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_22009" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24346436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_22010" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24346432" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_22011" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24346436" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/nncf_module/bert/encoder/layer.0/attention/self/query/BertForQuestionAnswering/BertModel[bert]/BertEncoder[encoder]/ModuleList[layer]/BertLayer[0]/BertAttention[attention]/BertSelfAttention[self]/NNCFLinear[query]/linear_0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/query/BertForQuestionAnswering/BertModel[bert]/BertEncoder[encoder]/ModuleList[layer]/BertLayer[0]/BertAttention[attention]/BertSelfAttention[self]/NNCFLinear[query]/linear_0|OUTPUT/FakeQuantize_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/nncf_module/bert/encoder/layer.0/attention/self/Shape_4" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/nncf_module/bert/encoder/layer.0/attention/self/Shape_4_output_0,/nncf_module/bert/encoder/layer.0/attention/self/Shape_5_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_16685" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="24346440" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_16686" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="23596560" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="108" name="Gather_16687" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/nncf_module/bert/encoder/layer.0/attention/self/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24346456" size="8" />
			<output>
				<port id="0" precision="I64" names="/nncf_module/bert/encoder/layer.0/attention/self/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/nncf_module/bert/encoder/layer.0/attention/self/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24346464" size="8" />
			<output>
				<port id="0" precision="I64" names="/nncf_module/bert/encoder/layer.0/attention/self/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/nncf_module/bert/encoder/layer.0/attention/self/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/nncf_module/bert/encoder/layer.0/attention/self/Concat_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_38228" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24346472" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Subtract_38229" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/nncf_module/bert/encoder/layer.0/attention/self/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/Reshape_2_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>7</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_405" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="24346504" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/nncf_module/bert/encoder/layer.0/attention/self/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>7</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/Transpose_1_output_0">
					<dim>1</dim>
					<dim>7</dim>
					<dim>384</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_38265" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 448" offset="24346536" size="1792" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_22012" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24348328" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_22013" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24348332" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_22014" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24348328" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_22015" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24348332" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/nncf_module/bert/encoder/layer.0/attention/self/key/BertForQuestionAnswering/BertModel[bert]/BertEncoder[encoder]/ModuleList[layer]/BertLayer[0]/BertAttention[attention]/BertSelfAttention[self]/NNCFLinear[key]/linear_0|INPUT0/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/key/BertForQuestionAnswering/BertModel[bert]/BertEncoder[encoder]/ModuleList[layer]/BertLayer[0]/BertAttention[attention]/BertSelfAttention[self]/NNCFLinear[key]/linear_0|INPUT0/FakeQuantize_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_38272" type="Const" version="opset1">
			<data element_type="i8" shape="448, 768" offset="24348336" size="344064" />
			<output>
				<port id="0" precision="I8">
					<dim>448</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Convert_24016" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>448</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>448</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_38279" type="Const" version="opset1">
			<data element_type="f32" shape="448, 1" offset="24692400" size="1792" />
			<output>
				<port id="0" precision="FP32">
					<dim>448</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="/nncf_module/bert/encoder/layer.0/attention/self/key/pre_ops.1/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>448</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>448</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/key/pre_ops.1/op/FakeQuantize_output_0">
					<dim>448</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="/nncf_module/bert/encoder/layer.0/attention/self/key/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>448</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/key/MatMul_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="/nncf_module/bert/encoder/layer.0/attention/self/key/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/key/Add_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Constant_22017" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24694192" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Constant_22018" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24694196" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Constant_22019" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24694192" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Constant_22020" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="24694196" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="/nncf_module/bert/encoder/layer.0/attention/self/key/BertForQuestionAnswering/BertModel[bert]/BertEncoder[encoder]/ModuleList[layer]/BertLayer[0]/BertAttention[attention]/BertSelfAttention[self]/NNCFLinear[key]/linear_0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
