<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="2" name="input_ids" type="Parameter" version="opset1">
			<data shape="1,384" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="attention_mask" type="Parameter" version="opset1">
			<data shape="1,384" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="token_type_ids" type="Parameter" version="opset1">
			<data shape="1,384" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="token_type_ids">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_43465" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 2" offset="0" size="8" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_43458" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="8" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_73178" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 167" offset="4104" size="668" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_43446" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="4772" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_73185" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="8868" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_43415" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="9380" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_73192" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 132" offset="13476" size="528" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>132</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_43403" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="14004" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_73199" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="18100" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_43372" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="18612" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_73206" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 142" offset="22708" size="568" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>142</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_43360" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="23276" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_73213" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 320" offset="27372" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_43329" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="28652" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_73220" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 152" offset="32748" size="608" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>152</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_43317" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="33356" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_73227" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="37452" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_43286" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="38476" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_73234" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 273" offset="42572" size="1092" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>273</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_43274" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="43664" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_73241" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="47760" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_43243" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="48784" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_73248" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 393" offset="52880" size="1572" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>393</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_43231" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="54452" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_73255" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="58548" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_43200" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="59572" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_73262" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 540" offset="63668" size="2160" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>540</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_43188" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="65828" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_73269" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="69924" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_43157" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="71460" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_73276" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 531" offset="75556" size="2124" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>531</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_43145" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="77680" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_73283" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 320" offset="81776" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_43114" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="83056" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_73290" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 542" offset="87152" size="2168" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>542</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_43102" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="89320" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_73297" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="93416" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_43071" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="94952" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_73304" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 520" offset="99048" size="2080" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>520</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_43059" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="101128" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_73311" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 448" offset="105224" size="1792" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_43028" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="107016" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_73318" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 705" offset="111112" size="2820" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>705</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_43016" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="113932" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_73325" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="118028" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_42985" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="119564" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_73332" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 746" offset="123660" size="2984" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>746</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_42973" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="126644" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_73339" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="130740" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_42942" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="132276" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_73346" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 803" offset="136372" size="3212" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>803</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_42930" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="139584" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_73353" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 256" offset="143680" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_42899" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="144704" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_73360" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 853" offset="148800" size="3412" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>853</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_42887" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="152212" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_73367" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="156308" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_42856" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="157076" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_73374" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 914" offset="161172" size="3656" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>914</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_42844" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="164828" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_73381" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 64" offset="168924" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_42813" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="169180" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_73388" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 877" offset="173276" size="3508" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>877</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_42801" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="176784" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_73395" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="180880" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_42770" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="181648" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_73402" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 974" offset="185744" size="3896" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>974</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_42758" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="189640" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_73409" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 320" offset="193736" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_42727" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="195016" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_73416" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 982" offset="199112" size="3928" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>982</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_42715" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="203040" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_73423" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 320" offset="207136" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_42684" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="208416" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_73430" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 955" offset="212512" size="3820" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>955</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_42672" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="216332" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_73437" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 64" offset="220428" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_42641" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="220684" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_73444" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 748" offset="224780" size="2992" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>748</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_42629" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="227772" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_73451" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="231868" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_42598" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="232636" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_73458" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 660" offset="236732" size="2640" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>660</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_42586" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="239372" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_73465" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="243468" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_42555" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="243980" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_73472" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 636" offset="248076" size="2544" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>636</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_42543" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="250620" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_73479" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="254716" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_42512" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="255484" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_73486" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 521" offset="259580" size="2084" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>521</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_42500" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="261664" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_73493" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 192" offset="265760" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_42469" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="266528" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_73500" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 642" offset="270624" size="2568" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>642</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_42457" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="273192" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_73507" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 320" offset="277288" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/nncf_module/bert/embeddings/word_embeddings/pre_ops.0/op/Constant" type="Const" version="opset1">
			<data element_type="i8" shape="30522, 1024" offset="278568" size="31254528" />
			<output>
				<port id="0" precision="I8">
					<dim>30522</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Convert_45072" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>30522</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30522</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_44979" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="31533096" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/nncf_module/bert/embeddings/word_embeddings/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>30522</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/word_embeddings/pre_ops.0/op/FakeQuantize_output_0">
					<dim>30522</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_260" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="31533100" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="105" name="/nncf_module/bert/embeddings/word_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>30522</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/nncf_module/bert/embeddings/word_embeddings/Gather_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/nncf_module/bert/embeddings/token_type_embeddings/pre_ops.0/op/Constant" type="Const" version="opset1">
			<data element_type="i8" shape="2, 1024" offset="31533108" size="2048" />
			<output>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Convert_45241" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_45148" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="31535156" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/nncf_module/bert/embeddings/token_type_embeddings/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/token_type_embeddings/pre_ops.0/op/FakeQuantize_output_0">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_266" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="31533100" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="111" name="/nncf_module/bert/embeddings/token_type_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/nncf_module/bert/embeddings/token_type_embeddings/Gather_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/nncf_module/bert/embeddings/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/Add_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_42413" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="31535160" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_42414" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="31535164" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_42415" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="31535160" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_42416" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="31535164" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/nncf_module/bert/embeddings/BertForQuestionAnswering/BertModel[bert]/BertEmbeddings[embeddings]/__add___0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/nncf_module/bert/embeddings/BertForQuestionAnswering/BertModel[bert]/BertEmbeddings[embeddings]/__add___0|OUTPUT/FakeQuantize_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/nncf_module/bert/embeddings/position_embeddings/pre_ops.0/op/Constant" type="Const" version="opset1">
			<data element_type="i8" shape="512, 1024" offset="31535168" size="524288" />
			<output>
				<port id="0" precision="I8">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Convert_45410" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_45317" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="32059456" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/nncf_module/bert/embeddings/position_embeddings/pre_ops.0/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/position_embeddings/pre_ops.0/op/FakeQuantize_output_0">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="onnx::Gather_6649" type="Const" version="opset1">
			<data element_type="i64" shape="1, 384" offset="32059460" size="3072" />
			<output>
				<port id="0" precision="I64" names="onnx::Gather_6649">
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_276" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="31533100" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="124" name="/nncf_module/bert/embeddings/position_embeddings/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/nncf_module/bert/embeddings/position_embeddings/Gather_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_42421" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32062532" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_42422" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32062536" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Constant_42423" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32062532" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_42424" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32062536" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="/nncf_module/bert/embeddings/position_embeddings/BertForQuestionAnswering/BertModel[bert]/BertEmbeddings[embeddings]/NNCFEmbedding[position_embeddings]/embedding_0|OUTPUT/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/nncf_module/bert/embeddings/position_embeddings/BertForQuestionAnswering/BertModel[bert]/BertEmbeddings[embeddings]/NNCFEmbedding[position_embeddings]/embedding_0|OUTPUT/FakeQuantize_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="/nncf_module/bert/embeddings/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/Add_1_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Constant_282" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="32062540" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="/nncf_module/bert/embeddings/LayerNorm/Div" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/LayerNorm/Div_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Constant_42425" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="32062548" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="/nncf_module/bert/embeddings/LayerNorm/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/LayerNorm/Mul_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Constant_42426" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="32066644" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="/nncf_module/bert/embeddings/LayerNorm/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/embeddings/LayerNorm/Add_1_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Constant_42427" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32070740" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Constant_42428" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32070744" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Constant_42429" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32070740" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="Constant_42430" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32070744" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="/nncf_module/bert/encoder/layer.0/attention/self/query/BertForQuestionAnswering/BertModel[bert]/BertEncoder[encoder]/ModuleList[layer]/BertLayer[0]/BertAttention[attention]/BertSelfAttention[self]/NNCFLinear[query]/linear_0|INPUT0/FakeQuantize" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/query/BertForQuestionAnswering/BertModel[bert]/BertEncoder[encoder]/ModuleList[layer]/BertLayer[0]/BertAttention[attention]/BertSelfAttention[self]/NNCFLinear[query]/linear_0|INPUT0/FakeQuantize_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="Constant_73514" type="Const" version="opset1">
			<data element_type="i8" shape="320, 1024" offset="32070748" size="327680" />
			<output>
				<port id="0" precision="I8">
					<dim>320</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="Convert_45531" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>320</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="Constant_73521" type="Const" version="opset1">
			<data element_type="f32" shape="320, 1" offset="32398428" size="1280" />
			<output>
				<port id="0" precision="FP32">
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="/nncf_module/bert/encoder/layer.0/attention/self/query/pre_ops.1/op/FakeQuantize" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>320</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/query/pre_ops.1/op/FakeQuantize_output_0">
					<dim>320</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="/nncf_module/bert/encoder/layer.0/attention/self/query/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/query/MatMul_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="/nncf_module/bert/encoder/layer.0/attention/self/query/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/nncf_module/bert/encoder/layer.0/attention/self/query/Add_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="Constant_42432" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32399708" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="Constant_42433" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="32399712" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="Constant_42434" type="Const" version="opset1">
